app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
---
  def index
    @articles = Article.order(created_at: :desc)

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "成功"], ["body", "できたはず"], ["created_at", "2020-09-30 15:02:11.858344"], ["updated_at", "2020-09-30 15:02:11.858344"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "をおおおおおお寇sdファ"], ["updated_at", "2020-10-08 14:18:44.108838"], ["id", 5]]
---
  def update
    if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
---
  def destroy
    if @article.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_post
    @article = Article.find(params[:id])